# Flip Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePlane..::..Flip Method
ReferencePlane Class See Also
---
Flips the orientation of the reference plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Flip()
```

Visual Basic
---
```text
Public Sub Flip
```

Visual C++
---
```text
public:
void Flip()
```

# See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace